from abc import ABC, abstractmethod


class Agent(ABC):

    @abstractmethod
    def abilities(self):
        pass

    @abstractmethod
    def bio(self):
        pass


class Brim(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає запальний гранатомет. Натисніть кнопку ВОГОНЬ, щоб запустити гранату, яка падає і вибухає після зупинки, "
                 "утворюючи палаючу ділянку, в якій всі гравці отримують шкоду.",
            'e': "Вибирає тактичну карту. Натисніть кнопку ВОГОНЬ, щоб вказати місця на карті для скидання димової завіси. Натисніть кнопку АЛЬТЕРНАТИВНИЙ ВОГОНЬ, "
                 "щоб запустити кілька димових завіс тривалої дії, які застилають огляд у зазначеній області.",
            'c': "Вибирає маячок-стимулятор. Натисніть кнопку ВОГОНЬ, щоб кинути його перед Brimstone. Після приземлення маячок підвищує скорострільність найближчих гравців.",
            'x': "Вибирає тактичну карту. Натисніть кнопку ВОГОНЬ, щоб запустити в обране місце орбітальний удар, що завдає високої періодичної шкоди гравцям, "
                 "які перебувають в обраній зоні.",
        }
        return abilities_dict

    def bio(self):
        inf = "Орбітальний арсенал Брімстоуна, який приєднався до нас зі США, гарантує, що його загін завжди матиме перевагу.Його здатність точно і на відстані " \
              "доставляти корисну інформацію робить його неперевершеним наземним командиром."
        return inf


class Viper(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає розпилювач газу. Натисніть кнопку ВОГОНЬ, щоб викинути розпилювач, який залишається на місці до кінця раунду. Застосуйте вміння повторно, "
                 "щоб випустити з розпилювача хмару отруйного диму, витрачаючи паливо. Можна використовувати більше одного разу. Розпилювач можна перемістити.",
            'e': "Вибирає розпилювачі газу. Натисніть кнопку ВОГОНЬ, щоб вистрілити довгою чергою розпилювачів. При повторному використанні розпилювачі утворюють "
                 "стіну отруйного диму, витрачаючи паливо. Уміння можна застосовувати більше одного разу.",
            'c': "Вибирає капсулу з кислотою. Натисніть кнопку ВОГОНЬ, щоб запустити капсулу, яка розбивається при падінні, залишаючи після себе калюжу кислоти. "
                 "Супротивники, які потрапили в кислоту, отримують шкоду і сповільнюються.",
            'x': "Вибирає розпилювач хімікатів. Натисніть кнопку ВОГОНЬ, щоб розпорошити навколо Viper хмару хімікатів, скорочуючи дальність зору і максимальний "
                 "запас здоров'я гравців, які перебувають у ньому.",
        }
        return abilities_dict

    def bio(self):
        inf = "Американський хімік <b>Вайпер</b> використовує низку отруйних хімічних пристроїв, щоб контролювати поле бою і калічити зір ворога. " \
              "Якщо токсини не вб'ють її здобич, то ігри розуму точно вб'ють."
        return inf


class Omen(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "МИТТЄВО випускає вперед тіньовий заряд, що ненадовго обмежує огляд гравців, яких він торкнеться. Цей заряд може проходити крізь стіни.",
            'e': "Вибирає тіньову сферу і переходить в іншу реальність, щоб прицілитися і встановити сфери. "
                 "НАТИСНІТЬ клавішу вміння, щоб кинути тіньову сферу, яка розширюється в обраній точці, обмежуючи огляд. "
                 "УТРИМУЙТЕ кнопку вогню, щоб збільшити дальність кидка сфери. УТРИМУЙТЕ кнопку АЛЬТЕРНАТИВНОГО ВОГНЮ, щоб кинути сферу ближче. "
                 "НАТИСНІТЬ клавішу ПЕРЕЗАРЯДКИ, щоб переключитися на звичайний режим прицілювання.",
            'c': "Вибирає вміння 'Прихований крок' і показує дальність його дії. Натисніть кнопку ВОГОНЬ, щоб після невеликої затримки телепортувати агента до обраного місця. "
                 "Противники почують звук телепортації тільки від точки відправлення.",
            'x': "Вибирає тактичну карту. Натисніть кнопку ВОГОНЬ, щоб почати телепортацію до обраного місця. Під час телепортації Omen постає в образі тіні, яка може бути"
                 " знищена ворогом для скасування телепортації. Omen також може скасувати телепортацію натисканням клавіші вміння.",
        }
        return abilities_dict

    def bio(self):
        inf = "Привид із минулого Omen завдає ударів із тіні. Він здатний засліплювати ворогів і непомітно переміщатися по полю бою, вселяючи" \
          " страх у серця супротивників, які марно намагаються передбачити, звідки він нападе знову."
        return inf


class Astra(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Розмістіть зірки в Астральній формі (X) АКТИВУЙТЕ зірку, щоб викликати 'Імпульс нової'. Він швидко заряджається і оглушує всіх гравців у зоні дії.",
            'e': "Розмістіть зірки в Астральній формі (X) АКТИВУЙТЕ зірку, щоб перетворити її на 'Туманність' (дим). Виберіть зірку і натисніть клавішу (F), "
                 "щоб викликати 'Розсіювання'. Зірка повертається і може бути розміщена в іншому місці через деякий час. Перед поверненням зірки 'Розсіювання' "
                 "на короткий час формує хибну 'Туманність' на місці зірки.",
            'c': "Розмістіть зірки в Астральній формі (X) АКТИВУЙТЕ зірку, щоб створити 'Гравітаційний колодязь'. Гравці в області дії притягуються до центру. "
                 "Потім 'Гравітаційний колодязь' вибухає, послаблюючи гравців усередині.",
            'x': "Натисніть кнопку 'АКТИВУВАТИ' (X), щоб увійти в Астральну форму і розмістити зірки за допомогою кнопки ОСНОВНОГО РЕЖИМУ СТРІЛЬБИ. "
                 "Потім зірки можна знову активувати, щоб створити 'Імпульс нової', 'Туманність' або 'Гравітаційний колодязь'. Коли 'Просторовий розлом' "
                 "заряджений, використовуйте кнопку АЛЬТ. РЕЖИМУ СТРІЛЬБИ в Астральній формі для вибору першої точки, а потім кнопку ОСНОВНОГО РЕЖИМУ СТРІЛЬБИ "
                 "для вибору другої точки. Виникне 'Просторовий розлом', який проходить через обрані точки. 'Просторовий розлом' блокує кулі і сильно знижує гучність звуків.",
        }
        return abilities_dict

    def bio(self):
        inf = "Astra керує енергією, простором і часом, змінюючи поле битви за своїм бажанням. Повний контроль над астральною формою і талант стратегічного передбачення" \
              " дозволяють агенту з Гани випереджати ворога на цілу вічність."
        return inf


class Harbor(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає захисну водяну сферу. Натисніть ВОГОНЬ, щоб кинути її. Натисніть АЛЬТ. ВОГОНЬ, щоб зробити кидок знизу. Сфера створює водяний щит, що руйнується і блокує кулі.",
            'e': "ВИБИРАЄ водяну стіну. НАТИСНІТЬ 'ВОГОНЬ', щоб послати воду вперед по землі. УТРИМУЙТЕ 'ВОГОНЬ', щоб переміщати воду по карті в напрямку свого прицілу і створити стіну "
                 "вздовж цієї траєкторії. НАТИСНІТЬ 'АЛЬТ. ВОГОНЬ' під час створення траєкторії, щоб зупинити воду. Гравці, які зіткнулися з хвилею, сповільнюються.",
            'c': "ВИБИРАЄ водяну хвилю, що проходить крізь стіни. НАТИСНІТЬ 'ВОГОНЬ', щоб відправити хвилю вперед. ВИКОРИСТОВУЙТЕ УМІННЯ ПОВТОРНО, щоб зупинити подальший рух хвилі. "
                 "Гравці, які зіткнулися з хвилею, сповільнюються.",
            'x': "ВИБИРАЄ повну силу артефакту. НАТИСНІТЬ 'ВОГОНЬ', щоб створити на землі гейзерне озеро. Ворожі гравці в зоні дії опиняються під прицілом гейзерних ударів. Такий удар ОГЛУШУЄ ціль.",
        }
        return abilities_dict

    def bio(self):
        inf = "Родом з індійського узбережжя, Харбор штурмує поле бою, володіючи стародавніми технологіями та пануючи над водою. Він здіймає пінисті пороги та нищівні хвилі, " \
              "щоб захистити своїх союзників і знищити тих, хто йому протистоїть."
        return inf


class Phoenix(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає сліпучу сферу, що летить по дузі і вибухає незабаром після кидка. Під час вибуху сфера засліплює всіх гравців, які дивилися на неї в момент вибуху. "
                 "Натисніть кнопку ВОГОНЬ, щоб загнути дугу сфери вліво, і кнопку АЛЬТ. ВОГОНЬ - вправо.",
            'e': "Вибирає вогняну кулю. Натисканням кнопки ВОГОНЬ випускається вогняна куля, яка вибухає після затримки або під час падіння на землю, створюючи охоплену"
                 " вогнем область, що завдає шкоди противникам.",
            'c': "Вибирає вогняну стіну. Натисканням кнопки ВОГОНЬ вперед випускається полум'я, що утворює стіну вогню. "
                 "Вона закриває огляд і завдає шкоди гравцям, які проходять через неї. УТРИМУЙТЕ КНОПКУ ВОГОНЬ, щоб зігнути стіну в бік прицілу.",
            'x': "МИТТЄВО позначає поточну позицію Phoenix. Якщо час дії вміння закінчується або якщо Phoenix гине, поки воно діє,"
                 " то він воскресає в точці, де почав застосовувати вміння, з повним запасом здоров'я.",
        }
        return abilities_dict

    def bio(self):
        inf = "Фенікс родом з Великобританії, зоряна сила Фенікса проявляється в його бойовому стилі, запалюючи поле бою спалахами і вогнями. " \
              "Незалежно від того, чи є у нього підтримка, чи ні, він кидається в бій на своїх умовах."
        return inf


class Reyna(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Коли Reyna вбиває противника, на 3 секунди з'являється сфера душі. Reyna МИТТЄВО поглинає сферу душі, яка знаходиться поблизу, швидко заповнюючи здоров'я.",
            'e': "МИТТЄВО поглинає сферу душі, що знаходиться поблизу, що дає невразливість на 2 секунди. Під час дії вміння 'ІМПЕРАТРИЦЯ' також дає невидимість.",
            'c': "Вибирає примарне око. ПРИ АКТИВАЦІЇ кидає око на близьку відстань. Око обмежує огляд усіх супротивників, які подивляться на нього. Око можна знищити.",
            'x': "ВІДРАЗУ ЖЕ впадає в сказ, підвищуючи швидкість стрільби і поводження зі зброєю. При кожному вбивстві час дії вміння продовжується.",
        }
        return abilities_dict

    def bio(self):
        inf = "Reyna, що виросла в самому серці Мексики, здатна здолати будь-кого в бою сам на сам, і вбивства надають їй сил. " \
              "Її міць обмежена лише майстерністю і дуже залежить від успіхів у бою."
        return inf


class Jett(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Jett миттєво піднімається високо в повітря.",
            'e': "Викликає короткочасний порив вітру. Використовуйте вміння повторно, щоб Jett зробила ривок у напрямку свого руху. Якщо Jett стоїть на місці, то вона робить ривок вперед.",
            'c': "МИТТЄВО кидає снаряд, що перетворюється на хмару, яка ненадовго закриває огляд, при зіткненні з поверхнею. УТРИМУЙТЕ клавішу вміння,"
                 " щоб змінювати напрямок руху диму за допомогою прицілу.",
            'x': "Озброюється набором високоточних кинджалів, які перезаряджаються після ліквідації противника. Натисніть кнопку ВОГОНЬ,"
                 " щоб кинути один кинджал у вашу ціль. Натисніть кнопку АЛЬТ. ВОГОНЬ, щоб кинути в ціль усі кинджали, що залишилися.",
        }
        return abilities_dict

    def bio(self):
        inf = "Представляючи свою рідну країну, Південну Корею, Джетт використовує маневрений та ухильний стиль ведення бою, що дозволяє їй ризикувати так, як ніхто інший. " \
              "Вона намотує кола в кожній сутичці, розсікаючи ворогів ще до того, як вони встигнуть зрозуміти, що їх вразило."
        return inf


class Raze(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "МИТТЄВО кидає вибуховий ранець, що прикріплюється до поверхонь. Використовуйте вміння повторно, щоб підірвати ранець, завдаючи шкоди і відштовхуючи агентів,"
                 " які знаходяться поруч. Raze не отримує прямої шкоди від цього вміння, але може постраждати при падінні, якщо ранець підкине її досить високо в повітря.",
            'e': "Вибирає касетну гранату. Натисніть кнопку ВОГОНЬ, щоб кинути гранату, яка вибухає, завдає шкоди і випускає гранати поменше, що завдають шкоди будь-якому"
                 " агенту в радіусі ураження.",
            'c': "Вибирає 'Бомботрон'. Натисніть кнопку ВОГОНЬ, щоб випустити його. 'Бомботрон' рухається по прямій і відскакує від стін. При виявленні цілі 'Бомботрон'"
                 " мчить до неї по прямій і вибухає, завдаючи великої шкоди при зіткненні.",
            'x': "Вибирає ракетомет. Натисніть кнопку ВОГОНЬ, щоб випустити ракету, що завдає величезної шкоди великій ділянці під час контакту.",
        }
        return abilities_dict

    def bio(self):
        inf = "Raze - майстер вибухової справи з Бразилії, володарка сильного характеру і ще більш потужних гармат. Вона здатна легко впоратися з противниками," \
              " що засіли в обороні, або зачистити невелике приміщення. Голосно і без зайвих церемоній."
        return inf


class Yoru(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Натисніть кнопку вміння, щоб вирвати нестабільний фрагмент реальності. Натисніть кнопку ВОГОНЬ, щоб кинути фрагмент. "
                 "При зіткненні фрагмента з твердою поверхнею виникає сліпучий спалах.",
            'e': "Вибирає нитку порталу. Натисніть кнопку ВОГОНЬ, щоб послати портал вперед, або АЛЬТ. ВОГОНЬ, щоб розмістити нерухому нитку. "
                 "Телепортуйтеся по нитці за допомогою кнопки вміння. Щоб імітувати телепорт, натисніть кнопку ВИКОРИСТОВУВАТИ.",
            'c': "Вибирає відлуння, яке під час активації створює дзеркальне відображення Yoru. Натисніть кнопку ВОГОНЬ, щоб послати відлуння вперед, "
                 "або АЛЬТ. ВОГОНЬ, щоб розмістити нерухоме відлуння. Щоб послати відлуння вперед, натисніть кнопку ВИКОРИСТОВУВАТИ.",
            'x': "Вибирає маску, яка дозволяє дивитися крізь виміри. Натисніть кнопку ВОГОНЬ, щоб переміститися у вимір, у якому Yoru невразливий і невидимий для ворогів",
        }
        return abilities_dict

    def bio(self):
        inf = "Уродженець Японії Yoru здатний створювати розриви в самій реальності, щоб непомітно пробиратися на ворожу територію. " \
              "Сила і хитрість дозволяють йому заставати ворогів зненацька - вони навіть не встигнуть зрозуміти, звідки прийшла смерть."
        return inf


class Neon(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "МИТТЄВО кидає енергетичний снаряд, який відскакує від поверхні один раз. Коли снаряд торкається поверхні, земля під ним електризується і відбувається оглушливий вибух.",
            'e': "МИТТЄВО накопичує заряд для підвищення швидкості. Перебуваючи в зарядженому стані, натисніть кнопку АЛЬТ. ВОГОНЬ, щоб прослизнути.",
            'c': "ЗАПУСКАЄ вперед по землі дві паралельні лінії подачі енергії. Лінії простягаються на невелику відстань або до найближчої поверхні, "
                 "після чого утворюються два енергетичних бар'єри, які блокують огляд.",
            'x': "Протягом короткого часу Neon використовує всю свою енергію і швидкість. Натисніть кнопку ВОГОНЬ, щоб перетворити енергію на смертоносний"
                 " електричний промінь високої точності. Час дії вміння продовжується після кожного вбивства.",
        }
        return abilities_dict

    def bio(self):
        inf = "Філіппінка Neon здатна неймовірно швидко пересуватися завдяки біоелектричним імпульсам, які генерує її тіло. " \
              "Це дає їй змогу заставати ворогів зненацька та розправлятися з ними швидше за блискавку."
        return inf


class Sage(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає сповільнювальну сферу. Натисніть кнопку ВОГОНЬ, щоб кинути сповільнювальну сферу вперед. Після падіння сфера створює поле, яке уповільнює гравців.",
            'e': "Вибирає сферу здоров'я. При наведенні на пораненого союзника і натисканні кнопки ВОГОНЬ активує поступове відновлення здоров'я. "
                 "Якщо Sage поранена, то натискання кнопки АЛЬТ. ВОГОНЬ активує ефект періодичного зцілення.",
            'c': "Вибирає сферу бар'єра. Натисніть кнопку ВОГОНЬ, щоб створити непрохідну стіну. Натисніть кнопку АЛЬТ. ВОГОНЬ, щоб повернути стіну перед встановленням.",
            'x': "Вибирає вміння, що воскрешає. Наведіть приціл на загиблого союзника і натисніть кнопку ВОГОНЬ, щоб почати воскресіння. "
                 "Після невеликої затримки ціль повернеться до життя з повним запасом здоров'я.",
        }
        return abilities_dict

    def bio(self):
        inf = "Захисниця Китаю Sage забезпечує безпеку команди в бою. Завдяки можливості воскрешати союзників і стримувати натиск ворога вона створює базу спокою на моторошному полі бою."
        return inf


class Cypher(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "МИТТЄВО кидає клітку перед Cypher. Активуйте її, щоб обмежити огляд супротивників, які проходять через неї, і уповільнити їх.",
            'e': "Вибирає шпигунську камеру. Натисніть кнопку ВОГОНЬ, щоб помістити камеру в обраному місці. Використовуйте вміння знову, "
                 "щоб керувати камерою. Під час керування камерою натисніть кнопку ВОГОНЬ, щоб вистрілити дротиком, що відстежує. "
                 "При влучанні в гравця дротик відзначає його місцезнаходження.",
            'c': "Вибирає розтяжку. Натисніть кнопку ВОГОНЬ, щоб установити в обраному місці руйнівну непомітну розтяжку, яка з'єднується з протилежною стіною. "
                 "Супротивники, які потрапили в неї, знерухомлюються і ненадовго виявляють себе, а через деякий час оглушаються.",
            'x': "При наведенні прицілу на мертвого противника МИТТЄВО розкриває місце розташування всіх живих ворогів.",
        }
        return abilities_dict

    def bio(self):
        inf = "Торговець інформацією з Марокко Cypher може самостійно створити цілу інформаційну мережу для відстеження дій противника. " \
              "Жодна таємниця не в безпеці. Жоден маневр не залишається непоміченим. 'Сайфер' завжди спостерігає."
        return inf


class Killjoy(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає замаскованого тривогобота. Натисніть кнопку ВОГОНЬ, щоб випустити бота, який атакує супротивників, що опинилися в його радіусі дії. "
                 "Досягнувши мети, бот вибухає, завдаючи шкоди і роблячи супротивників уразливими.",
            'e': "Вибирає турель. Натисніть кнопку ВОГОНЬ, щоб встановити турель, яка автоматично відстежує супротивників у 180-градусному секторі. "
                 "УТРИМУЙТЕ кнопку вміння, щоб відкликати турель.",
            'c': "Вибирає гранату 'Вулик'. Натисніть кнопку ВОГОНЬ, щоб кинути гранату. Після приземлення граната маскується. "
                 "АКТИВУЙТЕ 'Вулик', щоб випустити рій наноботів, які завдають шкоди.",
            'x': "Вибирає генератор поля блокування. Натисніть кнопку ВОГОНЬ, щоб встановити генератор. Затримує всіх супротивників, які перебувають у радіусі дії. "
                 "Противники можуть вивести генератор з ладу.",
        }
        return abilities_dict

    def bio(self):
        inf = "Геній із Німеччини. Killjoy легко захищає територію на полі бою за допомогою свого арсеналу винаходів. " \
              "Якщо противника не зупинить шкода від її пристроїв, то ефекти ослаблення, які вони наносять, допоможуть Killjoy легко з ним впоратися."
        return inf


class Chamber(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Натисніть кнопку вміння, щоб вибрати важкий пістолет. Натисніть кнопку АЛЬТ. ВОГОНЬ, щоб прицілитися з цього пістолета.",
            'e': "Розміщує телепорт-якір. Перебуваючи на землі в зоні дії якоря, натисніть кнопку вміння повторно, щоб швидко "
                 "телепортуватися до нього. Якір можна підібрати і розмістити заново.",
            'c': "Розміщує пастку, яка виявляє супротивників. Коли ворог опиняється в зоні дії, пастка спрацьовує після короткої затримки і "
                 "дестабілізує невелику область, сповільнюючи гравців у ній. Пастку можна підібрати і розмістити заново.",
            'x': "Натисніть кнопку вміння, щоб вибрати особливо потужну снайперську гвинтівку, з якої можна вбити ворога будь-яким прямим попаданням. "
                 "На місці загибелі противника виникає поле, що уповільнює гравців у його межах.",
        }
        return abilities_dict

    def bio(self):
        inf = "Добре вдягнений і добре озброєний, французький зброяр Chamber виганяє агресорів зі смертоносною точністю. " \
              "Він використовує свій власний арсенал, щоб утримувати оборону і знищувати ворогів здалеку, маючи запасний план на випадок непередбачуваних обставин."
        return inf


class Sova(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає шокову стрілу. Натисніть кнопку ВОГОНЬ, щоб випустити стрілу, що летить по прямій. При зіткненні вона спрацьовує, завдаючи шкоди гравцям поблизу. "
                 "УТРИМУЙТЕ КНОПКУ ВОГОНЬ, щоб збільшити дальність пострілу. Натискання кнопки АЛЬТ. ВОГОНЬ дозволяє стрілі відскакувати від стін до двох разів.",
            'e': "Вибирає розвідстрілу. Натисніть кнопку ВОГОНЬ, щоб випустити стрілу, що летить по прямій. При зіткненні вона активується, виявляючи супротивників. "
                 "УТРИМУЙТЕ КНОПКУ ВОГОНЬ для збільшення дальності пострілу. Натискання кнопки АЛЬТ. ВОГОНЬ дозволяє стрілі відскакувати від стін до двох разів.",
            'c': "Вибирає дрон-сову. Натисніть кнопку ВОГОНЬ, щоб випустити дрон і отримати контроль над його пересуванням. "
                 "Керуючи дроном, натисніть кнопку ВОГОНЬ, щоб вистрілити дротиком, що позначає. При влучанні в гравця дротик розкриває його позицію.",
            'x': "Вибирає три далекобійні стріли, що пробивають стіни особливим потужним імпульсом. Натисніть кнопку ВОГОНЬ, щоб випустити "
                 "імпульс по прямій перед агентом, завдаючи шкоди і розкриваючи позицію всіх поранених ворогів. Уміння можна використовувати ще два рази, поки активний таймер.",
        }
        return abilities_dict

    def bio(self):
        inf = "Народжений з вічної зими **** тундри, Сова вистежує, знаходить і знищує ворогів з безжальною ефективністю і точністю. " \
              "Його особливий лук і неймовірні здібності розвідника гарантують, що навіть якщо ви побіжите, вам не вдасться сховатися."
        return inf


class Breach(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає сліпучий заряд. Натисніть кнопку ВОГОНЬ, щоб запустити його через стіну. Заряд засліпить усіх гравців, які дивляться в його бік.",
            'e': "Вибирає сейсмічний заряд. УТРИМУЙТЕ КНОПКУ ВОГОНЬ, щоб збільшити дальність розлому. ВІДПУСТІТЬ, щоб створити розлом, що оглушує всіх гравців у зоні ураження.",
            'c': "Вибирає вибуховий заряд. Натисніть кнопку ВОГОНЬ, щоб запустити заряд через стіну і створити вибух на іншій стороні."
                 "Вибух завдає серйозної шкоди всім, хто потрапляє в зону ураження.",
            'x': "ВИБИРАЄ сейсмічну хвилю. Натисніть кнопку ВОГОНЬ, щоб запустити ланцюжок вибухів у великій області перед собою. "
                 "Ці вибухи оглушують і підкидають у повітря все на своєму шляху.",
        }
        return abilities_dict

    def bio(self):
        inf = "Швед Breach, який використовує біонічні посилення, покладається на потужні спрямовані вибухи, щоб розчистити шлях від агентів противника. " \
              "Руйнівна сила його умінь дає змогу отримати вирішальну перевагу в будь-якому бою."
        return inf


class Skye(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає фігурку тасманського вовка. Натисніть кнопку ВОГОНЬ, щоб викликати хижака і керувати ним. "
                 "Натисніть ВОГОНЬ, щоб тварина зробила ривок уперед, спричинила оглушливий вибух і завдала шкоди ураженим ворогам.",
            'e': "Вибирає фігурку яструба. Натисніть кнопку ВОГОНЬ, щоб послати яструба вперед. УТРИМУЙТЕ кнопку вогню, щоб яструб летів у напрямку вашого прицілу. "
                 "Під час польоту птаха використовуйте вміння знову, щоб яструб перетворився на сліпучий спалах. Осліплення ворога в зоні дії супроводжується сигналом влучання.",
            'c': "Вибирає зцілювальну фігурку. УДЕРЖУЙТЕ кнопку вогню, щоб лікувати союзників у зоні видимості та дії. "
                 "Після того, як запас лікування витрачено, вміння можна використовувати знову. Skye не може лікувати себе.",
            'x': "Вибирає фігурку нишпорки. Натисніть кнопку ВОГОНЬ, щоб послати трьох шукачів, які вистежують найближчих супротивників. Шукач обмежує огляд у знайденої цілі.",
        }
        return abilities_dict

    def bio(self):
        inf = "Австралійка Skye та її звірина зграя прокладають шлях по ворожій території. " \
              "Її створіння ускладнюють просування ворога, а сама Skye може лікувати союзників. " \
              "З нею команда буде в безпеці та стане сильнішою, ніж будь-коли."
        return inf


class Kayo(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає сліпучу гранату. Натисніть кнопку ВОГОНЬ, щоб кинути її. Граната швидко вибухає, засліплюючи всіх у зоні видимості.",
            'e': "Вибирає пригнічувальний клинок. Натисніть кнопку ВОГОНЬ, щоб кинути його. Клинок вибухає в тому місці, куди приземляється, і пригнічує всіх у радіусі вибуху.",
            'c': "Вибирає вибухонебезпечний фрагмент. Натисніть кнопку ВОГОНЬ, щоб кинути його. "
                 "Після приземлення фрагмента відбувається серія вибухів, кожен з яких завдає практично смертельної шкоди ворогам, які перебувають у самому центрі.",
            'x': "МИТТЄВО заряджається енергією поляризованого радіаніту, яка посилює KAY/O і спричиняє потужне випромінювання звідти, де він знаходиться.",
        }
        return abilities_dict

    def bio(self):
        inf = "KAY/O - бойова машина, створена лише для однієї мети: винищити радіантів. Його здатність пригнічувати вміння ворога істотно " \
              "послаблює команду противника і забезпечує надійний захист союзникам."
        return inf


class Fade(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "Вибирає чорнильну сферу. Натисніть кнопку ВОГОНЬ, щоб кинути її. Через деякий час сфера падає на землю, після чого"
                 " вибухає і утворює область-пастку, з якої важко вибратися. Використовуйте вміння повторно, щоб упустити сферу до того, як вона сама впаде.",
            'e': "Вибирає кошмарну сутність. Натисніть кнопку ВОГОНЬ, щоб кинути сферу. Через деякий час сфера падає на землю, "
                 "після чого перетворюється на кошмарну сутність, яка розкриває місце розташування всіх супротивників, що потрапили в її поле зору. "
                 "Противники можуть знищити кошмарну сутність. Використовуйте вміння повторно, щоб упустити сферу до того, як вона сама впаде.",
            'c': "Вибирає хижака. Натисніть кнопку ВОГОНЬ, щоб послати хижака вперед по прямій траєкторії. Хижак фокусується на всіх супротивниках"
                 " і слідах у полі свого зору і починає полювання, обмежуючи огляд спійманих цілей. Утримуйте кнопку ВОГОНЬ, щоб хижак рухався в напрямку вашого прицілу.",
            'x': "Вибирає силу страху. Натисніть кнопку ВОГОНЬ, щоб створити хвилю енергії Кошмару, що проходить крізь стіни. "
                 "Ця енергія оглушує противника і завдає йому періодичної шкоди, а також розкриває шлях до нього.",
        }
        return abilities_dict

    def bio(self):
        inf = "Турецька мисливиця за головами, Фейд, вивільняє силу сирих кошмарів, щоб заволодіти ворожими таємницями. " \
              "Налаштована на сам жах, вона полює на мішені та виявляє їхні найпотаємніші страхи, перш ніж розчавити їх у темряві."
        return inf


class Gekko(Agent):
    def abilities(self):
        abilities_dict = {
            'q': "ВИБИРАЄ WINGMAN. Натисніть ВОГОНЬ, щоб кинути WINGMAN, як гранату. Натисніть АЛЬТ. ВОГОНЬ, щоб зробити кидок знизу. "
                 "Торкнувшись поверхні, WINGMAN розділяється, покриваючи велику площу, і після невеликої затримки вибухає.",
            'e': "ВИБИРАЄ DIZZY. Натисніть ВОГОНЬ, щоб відправити DIZZY вперед шукати супротивників. D"
                 "IZZY вивільняє енергію в бік першого побаченого ворога, здійснюючи оглушливий вибух. "
                 "Натисніть АЛЬТ. ВОГОНЬ, націлившись на точку встановлення Spike або на встановлений Spike, щоб DIZZY встановив або знешкодив його. "
                 "Spike повинен бути в інвентарі Gekko, щоб DIZZY міг його встановити. Коли енергія закінчується, DIZZY перетворюється на кульку і не діє. "
                 "ВЗАЄМОДІЙТЕ з кулькою, щоб забрати її, і через короткий час DIZZY отримає новий заряд енергії.",
            'c': "ВИБИРАЄ MOSH PIT. Натисніть ВОГОНЬ, щоб запустити MOSH PIT високо в повітря і послати її вперед. "
                 "Зарядившись, MOSH PIT запускає згустки плазми, що вибухають, у бік супротивників у зоні видимості. Коли енергія закінчується, MOSH PIT перетворюється на кульку і не діє. "
                 "ВЗАЄМОДІЙТЕ з кулькою, щоб забрати її, і через короткий час MOSH PIT отримає новий заряд енергії.",
            'x': "ВИБИРАЄ THRASH. Натисніть ВОГОНЬ, щоб установити уявний зв'язок із THRASH і керувати її пересуванням по ворожій території. "
                 "Натисніть кнопку АКТИВАЦІЇ, щоб THRASH зробила ривок вперед і влаштувала вибух, сповільнивши ворогів на невеликій відстані від себе. "
                 "Коли енергія закінчується, THRASH перетворюється на кульку і не діє. ВЗАЄМОДІЙТЕ з кулькою, щоб забрати її, і через короткий час THRASH "
                 "отримає новий заряд енергії. Повторний заряд THRASH можна використовувати тільки один раз.",
        }
        return abilities_dict

    def bio(self):
        inf = "Gekko з Лос-Анджелеса заправляє дружною командою безбашенних істот. Його вірні звірята сміливо кидаються в бійку, " \
              "розносячи ворогів у пух і прах. А коли Gekko підбирає вихованців з поля бою, можна перевести дух і повторити!"
        return inf